app/controllers/finish_lots_controller.rb

  def index
    @lots = Lot.where("end_datetime <= ?", DateTime.now)
---
SELECT "lots".* FROM "lots" WHERE (end_datetime <= '2018-01-25 14:01:04.599638')