app/controllers/lots_controller.rb

SELECT "lots".* FROM "lots" WHERE (end_datetime <= '2018-01-25 14:01:00.550440')
---
  def index
    @lots = Lot.all

INSERT INTO "lots" ("title", "description", "start_price", "start_datetime", "end_datetime", "created_at", "updated_at", "user_id", "photo_file_name", "photo_content_type", "photo_file_size", "photo_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @lot = current_user.lots.new(lot_params)
      if @lot.save

UPDATE "lots" SET "photo_file_name" = $1, "photo_file_size" = $2, "photo_updated_at" = $3, "updated_at" = $4 WHERE "lots"."id" = $5  [["photo_file_name", "Nexus_5_Front_View.png"], ["photo_file_size", 364799], ["photo_updated_at", "2017-11-01 13:12:34.813537"], ["updated_at", "2017-11-01 13:12:35.434078"], ["id", 7]]
---
  def update
      if @lot.update(lot_params)

DELETE FROM "lots" WHERE "lots"."id" = $1  [["id", 2]]
---
  def destroy
    if @lot.user_id == current_user.id
      @lot.destroy

SELECT  "lots".* FROM "lots" WHERE "lots"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_lot
      @lot = Lot.find(params[:id])