app/controllers/rates_controller.rb

  def create
    rate.user = current_user
    if rate.save
---
INSERT INTO "rates" ("user_id", "lot_id", "users_rate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["lot_id", 8], ["users_rate", 1011], ["created_at", "2017-11-27 10:02:38.886884"], ["updated_at", "2017-11-27 10:02:38.886884"]]

    def set_lot
      @lot = Lot.find(params[:lot_id])
---
SELECT  "lots".* FROM "lots" WHERE "lots"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]